




Процедура ОбработкаПроведения(Отказ,Режим)
	
	Выборка = ПолучениеОстаткаДолга();
	
	// регистр Управленческий
	Движения.Управленческий.Записывать = Истина;
	Движения.Управленческий.Записать();
	Курс = ВалютныйУчёт.КурсВалютыНаДату(Дата, Валюта.КодВалюты);
	
	Пока Выборка.Следующий() Цикл
	
		Если Курс <> 0 И Выборка.СуммаВалОстаток <> 0 Тогда
			Движение = Движения.Управленческий.Добавить();
			Движение.Период = Дата;
			Движение.СчетДт = ПланыСчетов.Управленческий.Касса;
			Движение.СчетКт = ПланыСчетов.Управленческий.Покупатели;
			Движение.Организация = Организация; 
			Движение.Сумма = Выборка.Сумма; 
			Движение.ВалютаКт = Валюта;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Выборка.Контрагент;
			Если Выборка.Сумма < Выборка.СуммаВалОстаток * Курс Тогда
				Движение.СуммаВалКт = Выборка.Сумма / Курс;
			ИначеЕсли Выборка.Сумма = Выборка.СуммаВалОстаток * Курс Тогда
				Движение.СуммаВалКт = Выборка.СуммаВалОстаток;
			Иначе
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтрШаблон("Сумма: %1 превышает задолженность по контрагенту: %2. 
				| Текущая задолженность: %3", Выборка.Сумма, Выборка.Контрагент, Выборка.СуммаВалОстаток * Курс);
				Сообщение.Сообщить();
				Отказ = Истина;
				Продолжить;
			КонецЕсли;
		Иначе
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Нет задлженностей по контрагенту: %1", Выборка.Контрагент);
			Сообщение.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
	КонецЦикла;


	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Функция ПолучениеОстаткаДолга()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриходДенегРасчеты.Контрагент КАК Контрагент,
	|	СУММА(ПриходДенегРасчеты.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	Документ.ПриходДенег.Расчеты КАК ПриходДенегРасчеты
	|ГДЕ
	|	ПриходДенегРасчеты.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ПриходДенегРасчеты.Контрагент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Контрагент КАК Контрагент,
	|	ВТ.Сумма КАК Сумма,
	|	ЕСТЬNULL(УправленческийОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(УправленческийОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
	|	УправленческийОстатки.Субконто1 КАК Субконто1
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(&Дата, Счет = &Счет, &Субконто,
	|			Организация = &Организация
	|		И Субконто1 В
	|			(ВЫБРАТЬ
	|				ВТ.Контрагент КАК Контрагент
	|			ИЗ
	|				ВТ КАК ВТ)) КАК УправленческийОстатки
	|		ПО ВТ.Контрагент = УправленческийОстатки.Субконто1";
	
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Управленческий.Покупатели);
	Запрос.УстановитьПараметр("Субконто", ПланыВидовХарактеристик.ВидыСубконто.Контрагенты);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;	
		
КонецФункции