
 Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Управленческий 
	Движения.Управленческий.Записывать = Истина;

	  МенеджерВТ = Новый МенеджерВременныхТаблиц;
	  Запрос = Новый Запрос;
	  Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	  Запрос.Текст = "ВЫБРАТЬ
	                 |	ПриходДенегСписокКонтрагентов.Контрагент КАК Контрагент,
	                 |	СУММА(ПриходДенегСписокКонтрагентов.Сумма) КАК Сумма,
	                 |	СУММА(ПриходДенегСписокКонтрагентов.СуммаВал) КАК СуммаВал
	                 |ПОМЕСТИТЬ ТЧ
	                 |ИЗ
	                 |	Документ.ПриходДенег.СписокКонтрагентов КАК ПриходДенегСписокКонтрагентов
	                 |ГДЕ
	                 |	ПриходДенегСписокКонтрагентов.Ссылка = &Ссылка
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	ПриходДенегСписокКонтрагентов.Контрагент
	                 |
	                 |ИНДЕКСИРОВАТЬ ПО
	                 |	Контрагент
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	ТЧ.Контрагент КАК Контрагент,
	                 |	ТЧ.Сумма КАК Сумма,
	                 |	ТЧ.СуммаВал КАК СуммаВал
	                 |ИЗ
	                 |	ТЧ КАК ТЧ"; 
	  Запрос.УстановитьПараметр("Ссылка",Ссылка);
	  Выборка = Запрос.Выполнить().Выбрать();
	  
	  Пока Выборка.Следующий() Цикл  
		//Дт «Касса» - Кт «Покупатели» на сумму оплат 
		
		Движение = Движения.Управленческий.Добавить();
		Движение.Организация = Организация;
		Движение.СчетДт = ПланыСчетов.Управленческий.Касса;
		Движение.СчетКт = ПланыСчетов.Управленческий.Покупатели;
		Движение.Период = Дата;
		Движение.ВалютаКт = Валюта;
		Движение.Сумма = Выборка.Сумма;
		Движение.СуммаВалКт = Выборка.СуммаВал;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Выборка.Контрагент;
		
	КонецЦикла;	
	
	//Движения.Управленческий.БлокироватьДляИзменения = Истина;
	Движения.Записать();
	
	Отказ = КонтрольКорректностиОплатвПоСуммеЗадолженности(МенеджерВТ);
	
КонецПроцедуры

Функция КонтрольКорректностиОплатвПоСуммеЗадолженности(МенеджерВТ)
	
	ОтменитьПроведение = Ложь;
	
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст = "ВЫБРАТЬ
	                |	УправленческийОстатки.Субконто1 КАК Контрагент,
	                |	УправленческийОстатки.Субконто1.Представление КАК КонтрагентП,
	                |	УправленческийОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
	                |	УправленческийОстатки.Валюта КАК Валюта,
	                |	УправленческийОстатки.Валюта.Представление КАК ВалютаПредставление
	                |ИЗ
	                |	РегистрБухгалтерии.Управленческий.Остатки(
	                |			&ГраницаКонтроля,
	                |			Счет = &СчетПокупатели,
	                |			&Субконто,
	                |			Валюта = &Валюта
	                |				И Организация = &Организация
	                |				И Субконто1 В
	                |					(ВЫБРАТЬ
	                |						ТЧ.Контрагент КАК Контрагент
	                |					ИЗ
	                |						ТЧ КАК ТЧ)) КАК УправленческийОстатки
	                |ГДЕ
	                |	УправленческийОстатки.СуммаВалОстаток < 0"; 
	
	ГраницаКонтроля = Новый Граница(МоментВремени(),ВидГраницы.Включая);
	
	Субконто = Новый Массив;
	Субконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Контрагенты); 
	
	Запрос2.УстановитьПараметр("ГраницаКонтроля",ГраницаКонтроля);
	Запрос2.УстановитьПараметр("СчетПокупатели",ПланыСчетов.Управленческий.Покупатели);
	Запрос2.УстановитьПараметр("Валюта",Валюта);
	Запрос2.УстановитьПараметр("Субконто",Субконто);
	Запрос2.УстановитьПараметр("Организация",Организация);

	Результат = Запрос2.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ОтменитьПроведение;
	КонецЕсли;
	
	ОтменитьПроведение = Истина;
    Выборка = Результат.Выбрать(); 
	
	Пока Выборка.Следующий() Цикл 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Организация: %1,по Контрагенту: ""%2"" произошла переплата на сумму в валюте: %3 %4",Организация,Выборка.КонтрагентП,- Выборка.СуммаВалОстаток,Валюта);
		Сообщение.Сообщить();
	КонецЦикла;	
	
	Возврат ОтменитьПроведение;
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Переплата по контрагенту!";
	Сообщение.Сообщить();
	Возврат ОтменитьПроведение;
	
	Возврат ОтменитьПроведение;
	
КонецФункции	

