    

Функция КурсВалютыНаДату(Дата, КодВалюты) Экспорт
    СтрокаДаты = Формат(Дата, "ДФ=dd.MM.yyyy");
	ssl1 = Новый ЗащищенноеСоединениеOpenSSL();
    Соединение = Новый HTTPСоединение("www.cbr.ru", 443, , , , 30, ssl1);
    Запрос = Новый HTTPЗапрос("/scripts/XML_daily.asp?date_req=" + СтрокаДаты);
    
    Если КодВалюты = "RUR" Тогда
    	Возврат 0;
    КонецЕсли;

    Ответ = Соединение.Получить(Запрос);
    Если Ответ.КодСостояния = 200 Тогда
        ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		Курс = ЧтениеДанныхЦБ(ТелоОтвета, КодВалюты);
		Возврат Курс;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось получить информацию.";
		Сообщение.Сообщить();
		Возврат 0;
	КонецЕсли;
КонецФункции 

Функция ЧтениеДанныхЦБ(ТелоОтвета, КодВалюты)  
	
	ЧтениеXML = Новый ЧтениеXML;
	Попытка
        ЧтениеXML.УстановитьСтроку(ТелоОтвета);
    Исключение
        Сообщить("Ошибка чтения XML из строки: " + ОписаниеОшибки());
        Возврат 0;
	КонецПопытки;
	Пока ЧтениеXML.Прочитать() Цикл
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			Если ЧтениеXML.Имя = "Valute" Тогда
				Пока ЧтениеXML.Прочитать() И Не (ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Valute") Цикл
					Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "CharCode" Тогда
						ЧтениеXML.Прочитать();
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст И ЧтениеXML.Значение = КодВалюты Тогда
							Продолжить;
						Иначе
							Прервать;
						КонецЕсли;
					КонецЕсли;
					Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Value" Тогда
						ЧтениеXML.Прочитать();
						Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
							Курс = ЧтениеXML.Значение;
							Сообщить(СтрШаблон("Курс %1 = %2.", КодВалюты, Курс));
							Возврат Курс;
						КонецЕсли;		
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат 0;	
КонецФункции

           