
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//регистр Управленческий
	
	Движения.Управленческий.Записывать = Истина;
	Движения.Управленческий.Записать();
	
	Курс = ВалютныйУчёт.КурсВалютыНаДату(Дата, Валюта);
	
	Блокировка = Новый БлокировкаДанных();
	ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Управленческий");
	ЭлементБлокировки.УстановитьЗначение("Организация", Организация);
	ЭлементБлокировки.УстановитьЗначение("Счет", ПланыСчетов.Управленческий.Товары);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура, "Номенклатура");
	Блокировка.Заблокировать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество,
	|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ТЧ
	|ИЗ
	|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
	|ГДЕ
	|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.Номенклатура КАК Номенклатура,
	|	ТЧ.Количество КАК КолВоДок,
	|	ТЧ.Сумма КАК СуммаДок,
	|	БухОстПоСкладу.КоличествоОстатокДт КАК КолВоНаСкладе,
	|	БухОстПоТоварам.КоличествоОстатокДт КАК КолВоОстатокВсего,
	|	БухОстПоТоварам.СуммаОстатокДт КАК СуммаОстатокВсего,
	|	ТЧ.Номенклатура.Представление КАК НоменклатураП
	|ИЗ
	|	ТЧ КАК ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(&МоментВремени, Счет = &СчетТовары, &СубконтоСклад,
	|			Субконто1 В
	|			(ВЫБРАТЬ
	|				ТЧ.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ТЧ КАК ТЧ)
	|		И Организация = &Организация
	|		И Субконто2 = &Склад) КАК БухОстПоСкладу
	|		ПО ТЧ.Номенклатура = БухОстПоСкладу.Субконто1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Управленческий.Остатки(&МоментВремени, Счет = &СчетТовары, &СубконтоТовар,
	|			Субконто1 В
	|			(ВЫБРАТЬ
	|				ТЧ.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ТЧ КАК ТЧ)
	|		И Организация = &Организация) КАК БухОстПоТоварам
	|		ПО ТЧ.Номенклатура = БухОстПоТоварам.Субконто1";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("СчётТовары", ПланыСчетов.Управленческий.Товары);
	
	СубконтоСклад = Новый Массив();
	СубконтоСклад.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	СубконтоСклад.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склад);
	Запрос.УстановитьПараметр("СубконтоСклад", СубконтоСклад);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	СубконтоТовар = Новый Массив;
	СубконтоТовар.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
	Запрос.УстановитьПараметр("СубконтоТовар", СубконтоТовар);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Дефицит = Выборка.КолВоДок - Выборка.КолВоНаСкладе;
		
		Если Дефицит > 0 Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Для Организации: %1, на складе ""%2"", по номенклатурной позиции: ""%3"" не хватает %4 шт. ", Организация, Склад, Выборка.НоменклатураП, Дефицит);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Если Отказ Тогда
			Продолжить;
		КонецЕсли;
		
		Себестоимость = ?(Выборка.КолВоДок = Выборка.КолВоОстатокВсего, Выборка.СуммаОстатокВсего, Выборка.КолВоДок * Выборка.СуммаОстатокВсего / Выборка.КолВоОстатокВсего);
		
		// Дт Прибыли и убытки - Кт Товары
		
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Управленческий.ПрибылиУбытки;
		Движение.СчетКт = ПланыСчетов.Управленческий.Товары;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Сумма = Себестоимость;
		Движение.КоличествоКт = Выборка.КолВоДок;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = Склад;
		
		// Дт Покупатели - Кт Прибыли и убытки.
		
		Движение = Движения.Управленческий.Добавить();
		Движение.СчетДт = ПланыСчетов.Управленческий.Покупатели;
		Движение.СчетКт = ПланыСчетов.Управленческий.ПрибылиУбытки;
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ВалютаДт = Валюта;
		Движение.Сумма = Выборка.СуммаДок;
		Движение.СуммаВалДт = ?(Курс = 0,0,Движение.Сумма/Курс);
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
		
	КонецЦикла;
	
КонецПроцедуры
