
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаПоДокументу = СписокНоменклатуры.Итог("Сумма");
КонецПроцедуры


//Документ «Приходная накладная» реализует следующую проводку:


Процедура ОбработкаПроведения(Отказ,Режим)
	
	Курс = ВалютныйУчёт.КурсВалютыНаДату(Дата, Валюта.КодВалюты);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПриходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
	|	СУММА(ПриходнаяНакладнаяСписокНоменклатуры.Количество) КАК КолВоДок,
	|	СУММА(ПриходнаяНакладнаяСписокНоменклатуры.Сумма) КАК СуммаДок
	|ИЗ
	|	Документ.ПриходнаяНакладная.СписокНоменклатуры КАК ПриходнаяНакладнаяСписокНоменклатуры
	|ГДЕ
	|	ПриходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ПриходнаяНакладнаяСписокНоменклатуры.Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();


	// регистр Управленческий
	Движения.Управленческий.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		//Дт «Товары» - Кт «Поставщики»
		Движение = Движения.Управленческий.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		
		Движение.Сумма = Выборка.СуммаДок; //?(Курс = 0,Выборка.СуммаДок, Выборка.СуммаДок*Курс);
		Движение.СчетДт = ПланыСчетов.Управленческий.Товары;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Склад] = Склад;
		Движение.КоличествоДт = Выборка.КолВоДок;
		
		Движение.СчетКт = ПланыСчетов.Управленческий.Поставщики;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Номенклатура] = Выборка.Номенклатура; 
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Контрагенты] = Контрагент;
		Движение.КоличествоКт = Выборка.КолВоДок;
		Движение.ВалютаКт = Валюта;
		Движение.СуммаВалКт = ?(Курс = 0,0,Выборка.СуммаДок/Курс);
	КонецЦикла;
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры